Repository: nsomazr/ai4ch
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: English
sw: Kiingereza

source: Swahili
sw: Kiswahili

source: Password fields didn't match.
sw: Sehemu za nywila hazifanani.

source: Old password is not correct
sw: Nywila ya zamani si sahihi

source: Please correct the errors below.
sw: Tafadhali sahihisha makosa yaliyo hapa chini.

source: Registration failed.
sw: Usajili umeshindwa.

source: Staff member added successfully!
sw: Mfanyakazi ameongezwa kwa mafanikio!

source: An error occurred while adding staff.
sw: Hitilafu imetokea wakati wa kuongeza mfanyakazi.

source: First Name
sw: Jina la Kwanza

source: Last Name
sw: Jina la Mwisho

source: Phone Number
sw: Namba ya Simu

source: Email Address
sw: Anwani ya Barua Pepe

source: Role
sw: Wadhifa

source: Region
sw: Mkoa

source: District
sw: Wilaya

source: Ward
sw: Kata

source: Street
sw: Mtaa

source: Password
sw: Nywila

source: Confirm Password
sw: Thibitisha Nywila

source: Add Staff
sw: Ongeza Mfanyakazi

source: Cancel
sw: Ghairi

source: Account
sw: Akaunti

source: Update Info
sw: Sasisha Taarifa

source: Change Password
sw: Badilisha Nywila

source: Users
sw: Watumiaji

source: Staffs
sw: Wafanyakazi

source: Traffic
sw: Matumizi

source: Analytics
sw: Uchambuzi

source: Image Detection
sw: Utambuzi wa Picha

source: Video Detection
sw: Utambuzi wa Video

source: Beans
sw: Maharage

source: Cassava
sw: Muhogo

source: Maize
sw: Mahindi

source: Rice
sw: Mpunga

source: Add
sw: Ongeza

source: News
sw: Habari

source: Add New
sw: Ongeza Mpya

source: / Add New
sw: / Ongeza Mpya

source: Projects
sw: Miradi

source: / Add Projects
sw: / Ongeza Miradi

source: Uploads Statistics
sw: Takwimu za Upakiaji

source: Home
sw: Mwanzo

source: Dashboard
sw: Dashibodi

source: Analytics Dashboard
sw: Dashibodi ya Uchambuzi

source: / Analytics
sw: / Uchambuzi

source: Time Filter:
sw: Kichujio cha Muda:

source: All Time
sw: Muda Wote

source: Last 24 Hours
sw: Masaa 24 Yaliyopita

source: Last Week
sw: Wiki Iliyopita

source: Last Month
sw: Mwezi Uliopita

source: Users per Region
sw: Watumiaji kwa Mkoa

source: Crop Distribution
sw: Mgawanyo wa Mazao

source: Prediction Results
sw: Matokeo ya Utabiri

source: File Type Distribution
sw: Mgawanyo wa Aina za Faili

source: Update Password
sw: Sasisha Nywila

source: Login
sw: Ingia

source: Portal Login
sw: Ingia Kwenye Tovuti

source: Email
sw: Barua Pepe

source: Register
sw: Jisajili

source: Don't have an account?
sw: Huna akaunti?

source: Return to Home
sw: Rudi Mwanzo

source: / List
sw: / Orodha

source: News List
sw: Orodha ya Habari

source: Pulisher
sw: Mchapishaji

source: Title
sw: Kichwa

source: Status
sw: Hali

source: Action
sw: Kitendo

source: Published
sw: Imechapishwa

source: Not Published
sw: Haijachapishwa

source: Delete
sw: Futa

source: Review
sw: Pitia

source: Pulish
sw: Chapisha

source: Format: +255XXXXXXXXX
sw: Muundo: +255XXXXXXXXX

source: Minimum 8 characters
sw: Angalau herufi 8

source: Already have an account?
sw: Una akaunti tayari?

source: Crop Reports
sw: Ripoti za Mazao

source: / Crop Data
sw: / Data za Mazao

source: Crop Data Report
sw: Ripoti ya Data za Mazao

source: Download CSV
sw: Pakua CSV

source: User Region
sw: Mkoa wa Mtumiaji

source: User District
sw: Wilaya ya Mtumiaji

source: File Type
sw: Aina ya Faili

source: Crop Type
sw: Aina ya Zao

source: Image Region
sw: Mkoa wa Picha

source: Image District
sw: Wilaya ya Picha

source: Date
sw: Tarehe

source: Actions
sw: Vitendo

source: View Predictions
sw: Tazama Utabiri

source: previous
sw: iliyopita

source: first
sw: ya kwanza

source: next
sw: inayofuata

source: last
sw: ya mwisho

source: Crop Report Details
sw: Maelezo ya Ripoti ya Mazao

source: Back
sw: Rudi

source: View Original Image
sw: Tazama Picha Asili

source: Result ID
sw: Namba ya Matokeo

source: Uploaded By
sw: Imepakiwa na

source: Predicted Disease
sw: Ugonjwa Uliotabiriwa

source: Confidence Score
sw: Kiwango cha Uhakika

source: File Name
sw: Jina la Faili

source: File Path
sw: Njia ya Faili

source: Prediction Date
sw: Tarehe ya Utabiri

source: Original Image
sw: Picha Asili

source: Detailed Probabilities
sw: Uwezekano wa Kina

source: Object Detection Details
sw: Maelezo ya Utambuzi wa Vitu

source: View Original Input
sw: Tazama Ingizo Asili

source: View Processed Output
sw: Tazama Tokeo Lililochakatwa

source: Your browser does not support the video tag.
sw: Kivinjari chako hakiwezi kuonyesha video

source: Detailed Detection Results
sw: Maelezo ya Kina ya Utambuzi

source: Class
sw: Daraja

source: Count
sw: Idadi

source: Verify Phone Number
sw: Thibitisha Namba ya Simu

source: Verification Code
sw: Namba ya Uthibitisho

source: Verify Code
sw: Thibitisha Namba

source: Beans Disease Classification
sw: Uainishaji wa Magonjwa ya Maharage

source: Beans Disease Detection
sw: Utambuzi wa Magonjwa ya Maharage

source: Cassava Disease Classification
sw: Uainishaji wa Magonjwa ya Muhogo

source: Cassava Disease Detection
sw: Utambuzi wa Magonjwa ya Muhogo

source: Maize Disease Classification
sw: Uainishaji wa Magonjwa ya Mahindi

source: Maize Disease Detection
sw: Utambuzi wa Magonjwa ya Mahindi

source: Rice Disease Classification
sw: Uainishaji wa Magonjwa ya Mpunga

source: Rice Disease Detection
sw: Utambuzi wa Magonjwa ya Mpunga

source: Detection Analysis
sw: Uchambuzi wa Utambuzi

source: detected
sw: imetambuliwa

source: Reports
sw: Ripoti

source: DASHBOARD
sw: DASHIBODI

source: Back to Previous
sw: Rudi Nyuma

source: Drag & Drop Cassava Images
sw: Buruta na Weka Picha za Muhogo

source: Drag & Drop Rice Images
sw: Buruta na Weka Picha za Mpunga

source: Drag & Drop Beans Images
sw: Buruta na Weka Picha za Maharage

source: Drag & Drop Means Images
sw: Buruta na Weka Picha za Mahindi

source: or click to browse files (JPEG, PNG, MP4)
sw: au bofya kuchagua faili(JPEG, PNG, MP4)

source: Recommended Suppliers
sw: Wasambazaji Waliopendekezwa

source: Healthy Plant Detected
sw: Mmea Mzima Umetambuliwa

source: Call Now
sw: Piga Simu Sasa

source: Username
sw: Jina la Mtumiaji

source: Directions
sw: Maelekezo

source: No signs of maize diseases found
sw: Hakuna dalili za magonjwa ya mahindi zimepatikana

source: No signs of rice diseases found
sw: Hakuna dalili za magonjwa ya mpunga zimepatikana

source: No signs of cassava diseases found
sw: Hakuna dalili za magonjwa ya muhogo zimepatikana

source: No signs of beans diseases found
sw: Hakuna dalili za magonjwa ya maharage zimepatikana

source: Recommended Treatments
sw: Matibabu Pendekezwa

source: Causative Agent:
sw: Visababishi

source: No Local Suppliers Found
sw: Hakuna Muuzaji Karibu

source: Treatments Available
sw: Matibabu Yaliyopo

source: / Staffs
sw: / Wafanyakazi

source: Logout
sw: Toka
